In [1]:
!pip install pandas as pd

zsh:1: command not found: pip

In [2]:
import pandas as pd

In [7]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'Age': [25, 30, 35, 40, 45, 50],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia']
    
    })

In [8]:
print(df)

      Name  Age          City
0    Alice   25      New York
1      Bob   30   Los Angeles
2  Charlie   35       Chicago
3    David   40       Houston
4      Eve   45       Phoenix
5    Frank   50  Philadelphia

In [9]:
df.head()  # Display the first few rows of the DataFrame

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eve   45      Phoenix

In [10]:
df.tail()  # Display the last few rows of the DataFrame

      Name  Age          City
1      Bob   30   Los Angeles
2  Charlie   35       Chicago
3    David   40       Houston
4      Eve   45       Phoenix
5    Frank   50  Philadelphia

In [11]:
df.info()  # Display information about the DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   City    6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [12]:
df.keys()  # Display the column names

Index(['Name', 'Age', 'City'], dtype='object')

In [13]:
df.items()  # Display the items in the DataFrame

In [18]:
df['Age'].mean()  # Calculate the maximum value of the 'Age' column

np.float64(37.5)

In [19]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank']}

In [20]:
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank']}

In [21]:
print(pd.DataFrame(data))  # Create a DataFrame from the data dictionary

      Name
0    Alice
1      Bob
2  Charlie
3    David
4      Eve
5    Frank

In [22]:
df['Name'].unique()  # Display unique values in the 'Name' column

array(['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'], dtype=object)

In [23]:
df.sample(3)  # Randomly sample 3 rows from the DataFrame

      Name  Age         City
2  Charlie   35      Chicago
4      Eve   45      Phoenix
1      Bob   30  Los Angeles

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [26]:
df.describe()  # Get a statistical summary of the DataFrame

             Age
count   6.000000
mean   37.500000
std     9.354143
min    25.000000
25%    31.250000
50%    37.500000
75%    43.750000
max    50.000000

In [29]:
df['City'].unique()  # Select specific columns from the DataFrame

array(['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix',
       'Philadelphia'], dtype=object)

In [32]:
df.columns[:3]

Index(['Name', 'Age', 'City'], dtype='object')

In [34]:
df.iloc[0:2]  # Select specific rows and columns

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

In [35]:
df.loc[0:2, ['Name', 'Age']]  # Select specific rows and columns by label

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [38]:
df.loc[df['City'] == 'New York']  # Filter rows based on a condition

    Name  Age      City
0  Alice   25  New York

In [39]:
df.query('Age > 30')  # Filter rows based on a condition using query

      Name  Age          City
2  Charlie   35       Chicago
3    David   40       Houston
4      Eve   45       Phoenix
5    Frank   50  Philadelphia

In [50]:
df['Age'].quantile()     # Calculate the maximum value of the 'Age' column

np.float64(37.5)

In [53]:
df['Age'].rank()  # Calculate the rank of the 'Age' column

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
Name: Age, dtype: float64

In [54]:
df['Age'].shift(1)  # Shift the 'Age' column by 1 row

0     NaN
1    25.0
2    30.0
3    35.0
4    40.0
5    45.0
Name: Age, dtype: float64

In [55]:
df['Age'].cumsum()  # Calculate the cumulative sum of the 'Age' column

0     25
1     55
2     90
3    130
4    175
5    225
Name: Age, dtype: int64

In [56]:
df['Age'].rolling(window=2).mean()  # Calculate the rolling mean of the 'Age' column

0     NaN
1    27.5
2    32.5
3    37.5
4    42.5
5    47.5
Name: Age, dtype: float64

In [57]:
df['Age'].clip(lower=30, upper=45)  # Clip the 'Age' column values between 30 and 45

0    30
1    30
2    35
3    40
4    45
5    45
Name: Age, dtype: int64

In [61]:
pd.set_option('display.max_columns', None)  # Show all columns in the DataFrame

In [63]:
df.head()

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eve   45      Phoenix

In [64]:
df.pop('Age')  # Remove the 'Age' column from the DataFrame

0    25
1    30
2    35
3    40
4    45
5    50
Name: Age, dtype: int64

In [65]:
df

      Name          City
0    Alice      New York
1      Bob   Los Angeles
2  Charlie       Chicago
3    David       Houston
4      Eve       Phoenix
5    Frank  Philadelphia